{
    "portfolio": "Web sitemize hoş geldiniz!",
    "skills": "Yetenekler",
    "projects": "Projeler",
    "hireMe": "Beni İşe Al!",
    "creative": "Yaratıcı düşünür Minimalizm aşığı",
    "bora": "Merhaba ben Bora. Ben tam kapsamlı bir geliştiriciyim. Mükemmel kullanıcı deneyimleriyle sağlam ve ölçeklenebilir ön uç ürünleri üretecek bir Geliştirici arıyorsanız. Benimle el sıkışalım.",
    "react":"React, kullanıcı arayüzleri oluşturmak için kullanılan bir JavaScript kütüphanesidir. Bileşen bazlı mimarisi sayesinde uygulamaların bakımını ve genişletilmesini kolaylaştırır.",
    "redux":"Redux, JavaScript uygulamalarında durum yönetimini sağlayan bir kütüphanedir. Uygulama durumu, merkezi bir mağaza üzerinden yönetilerek uygulamanın daha predictible (öngörülebilir) hale gelmesini sağlar.",
    "axios":"Axios, HTTP istekleri yapmak için kullanılan bir JavaScript kütüphanesidir. Hem tarayıcıda hem de Node.js ortamında çalışabilir, API'lerle veri alışverişi yapmayı kolaylaştırır.",
    "birthDate":"Doğum Tarihi",
    "CityofResidence":"Yaşadığı Şehir",
    "educationalStatus":"Eğitim Durumu",
    "preferredRole":"Tercih Edilen Rol",
    "hobbies":"Hobiler",
    "aboutMe":"Hakkımda",
    "aboutMeTitle":"Eğitim yıllarında sahip olduğum teknik bilgi ve becerilerimi profesyonel iş hayatımda ki pratikler ile harmanlayıp beklenen ticari getiriye ulaşmayı hedefledim. Kavramsal ve analitik düşünme gerektiren projelere büyük ilgi duyarım. Başarının, istikrarlı ve araştırmayı seven kurumsal bir yapı dahilinde geleceğine inanırım. Bu inanç ve beklenti başarının anahtarı olmalı.",
    "aboutMeTitlei":"Bireysel ve takım çalışmalarında sabırlı, hedefe odaklı bir analitik düşünce yapısına sahibim. Sahip olduğum bu yapı, benden beklenen başarının üzerine çıktığım takdirde yaşayacağım haz ile ödüllendiriliyor.",
    "projectsTitle":"Kullanıcılarınızın hangi çerezleri kabul edeceğini veya reddedeceğini seçmesine olanak tanıyan basit, özelleştirilebilir, minimal kurulum çerez eklentisi. Bu, vanilya JS, SCSS ve Parcel Bundler ile oluşturulmuştur ve bir NPM paketi olarak mevcuttur ve git deposu, kod ve temalarda her türlü özelleştirmeyi mümkün kılar.",
    "projectsViewLink":"Siteyi Görüntüle",
    "fotterTitle":"Bir sonraki ürününüz üzerinde birlikte çalışalım."
  }